20220621/Catalogs/тм_ДинамическиеПодписки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>тм_ДинамическиеПодписки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВыполнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсточникиПодписки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИсточникПодписки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

20220621/Catalogs/тм_ДинамическиеПодписки/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы
 &НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЗаполнитьПараметрыВыбора();

КонецПроцедуры
 
&НаКлиенте
Процедура ПриОткрытии(Отказ) 

	КодВыполненияHTML = тм_ОбщегоНазначенияКлиент.РаскраситьКод1С8(Объект.КодВыполнения);	
	Элементы.СтраницыТекстовОбработки.ТекущаяСтраница = Элементы.СтраницыТекстовОбработки.ПодчиненныеЭлементы.HTML;		
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипОбъектаПриИзменении(Элемент)
	
	ЗаполнитьПараметрыВыбораСобытий();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьКонструкторЗапроса(Команда)
	
	ФормаКЗ = ПолучитьФорму("Обработка.УКО_УправляемаяКонсольОтчетов.Форма",,ЭтаФорма, ЭтаФорма.УникальныйИдентификатор);
	ФормаКЗ.ТекстЗапроса = Объект.КодВыполнения; 
	СтруктураДанных = Новый Структура("Текст");
	СтруктураДанных.Вставить("амвас", 22);
	СтруктураДанных.Вставить("Текст", Элементы.КодВыполнения.ВыделенныйТекст);

	ФормаКЗ.ТекущиеДанные = СтруктураДанных;
	ФормаКЗ.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьКодОбработки(Команда)
	
	Элементы.РедактироватьКодОбработки.Пометка = Не Элементы.РедактироватьКодОбработки.Пометка;
	Если Элементы.РедактироватьКодОбработки.Пометка Тогда
		Элементы.СтраницыТекстовОбработки.ТекущаяСтраница = Элементы.СтраницыТекстовОбработки.ПодчиненныеЭлементы.Текст;
	Иначе 
		КодВыполненияHTML = тм_ОбщегоНазначенияКлиент.РаскраситьКод1С8(Объект.КодВыполнения);	
		Элементы.СтраницыТекстовОбработки.ТекущаяСтраница = Элементы.СтраницыТекстовОбработки.ПодчиненныеЭлементы.HTML;		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПараметрыВыбора()

	Элементы.ТипОбъекта.СписокВыбора.Добавить("Документ", "Документ",, БиблиотекаКартинок.Документ);
	Элементы.ТипОбъекта.СписокВыбора.Добавить("Справочник", "Справочник",, БиблиотекаКартинок.Справочник);

КонецПроцедуры // ЗаполнитьПараметрыВыбора()

&НаСервере
Процедура ЗаполнитьПараметрыВыбораСобытий()
	
	Элементы.Событие.СписокВыбора.Добавить("ПриУстановкеНовогоНомера", "При установке нового номера");			
	Элементы.Событие.СписокВыбора.Добавить("ПриКопировании", "При копировании");	
	Элементы.Событие.СписокВыбора.Добавить("ОбработкаЗаполнения", "Обработка заполнения");	
	Элементы.Событие.СписокВыбора.Добавить("ПередЗаписью", "Перед записью");	
	Элементы.Событие.СписокВыбора.Добавить("ПриЗаписи", "При записи");	
	Элементы.Событие.СписокВыбора.Добавить("ПередУдалением", "Перед удалением");	
	Элементы.Событие.СписокВыбора.Добавить("ОбработкаПроведения", "Обработка проведения");	
	Элементы.Событие.СписокВыбора.Добавить("ОбработкаУдаленияПроведения", "Обработка удаления проведения");	
	Элементы.Событие.СписокВыбора.Добавить("ОбработкаПроверкиЗаполнения", "Обработка проверки заполнения");	
	Элементы.Событие.СписокВыбора.Добавить("ОбработкаФормированияПоВерсииИсторииДанных", "Обработка формирования по версии истории данных");
	
	Элементы.ИсточникиПодписки.ПодчиненныеЭлементы.ИсточникиПодпискиИсточникПодписки.СписокВыбора.Очистить();
	
	Если Объект.ТипОбъекта = "Документ" Тогда
		РазрешитьПроведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить;
		Для каждого Стр Из Метаданные.Документы Цикл
			Если Стр.Проведение = РазрешитьПроведение Тогда
				Элементы.ИсточникиПодписки.ПодчиненныеЭлементы.ИсточникиПодпискиИсточникПодписки.СписокВыбора.Добавить(Стр.ПолноеИмя(), Стр.Синоним,, БиблиотекаКартинок.Документ);		
			КонецЕсли; 
		КонецЦикла;
		Элементы.ДекорацияТипОбъекта.Картинка = БиблиотекаКартинок.Документ;
	Иначе 
		Элементы.Событие.СписокВыбора.Удалить(Элементы.Событие.СписокВыбора.НайтиПоЗначению("ОбработкаПроведения")); 
		Элементы.Событие.СписокВыбора.Удалить(Элементы.Событие.СписокВыбора.НайтиПоЗначению("ОбработкаУдаленияПроведения")); 
		
		Для каждого Стр Из Метаданные.Справочники Цикл
			Элементы.ИсточникиПодписки.ПодчиненныеЭлементы.ИсточникиПодпискиИсточникПодписки.СписокВыбора.Добавить(Стр.ПолноеИмя(), Стр.Синоним,, БиблиотекаКартинок.Справочник);		
		КонецЦикла;	
		Элементы.ДекорацияТипОбъекта.Картинка = БиблиотекаКартинок.Справочник;	
	КонецЕсли; 	

КонецПроцедуры // ЗаполнитьПараметрыВыбора()

#КонецОбласти
